7767517
377 421
Input                    in0                      0 1 in0
Convolution              conv_28                  1 1 in0 1 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648
HardSwish                hswish_154               1 1 1 2 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_0              1 2 2 3 4
ConvolutionDepthWise     convdw_270               1 1 4 5 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 7=24
Convolution              conv_29                  1 1 5 6 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              conv_30                  1 1 3 7 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=192
HardSwish                hswish_156               1 1 7 8 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_271               1 1 8 9 0=8 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=72 7=8
Split                    splitncnn_1              1 2 9 10 11
Pooling                  gap_4                    1 1 11 12 0=1 4=1
Convolution              convrelu_0               1 1 12 13 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=1
Convolution              conv_32                  1 1 13 14 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16
HardSigmoid              hsigmoid_140             1 1 14 15 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_0                    2 1 10 15 16 0=2
Convolution              conv_33                  1 1 16 17 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
HardSwish                hswish_157               1 1 17 18 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_155               1 1 6 19 0=1.666667e-01 1=5.000000e-01
Concat                   cat_0                    2 1 19 18 20 0=0
ConvolutionDepthWise     convdw_272               1 1 20 21 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
HardSwish                hswish_158               1 1 21 22 0=1.666667e-01 1=5.000000e-01
Convolution              conv_34                  1 1 22 23 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
HardSwish                hswish_159               1 1 23 24 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_2              1 2 24 25 26
ConvolutionDepthWise     convdw_273               1 1 26 27 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32
Convolution              conv_35                  1 1 27 28 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Convolution              conv_36                  1 1 25 29 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
HardSwish                hswish_161               1 1 29 30 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_274               1 1 30 31 0=12 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=108 7=12
Split                    splitncnn_3              1 2 31 32 33
Pooling                  gap_5                    1 1 33 34 0=1 4=1
Convolution              convrelu_1               1 1 34 35 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36 9=1
Convolution              conv_38                  1 1 35 36 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36
HardSigmoid              hsigmoid_141             1 1 36 37 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_1                    2 1 32 37 38 0=2
Convolution              conv_39                  1 1 38 39 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=288
HardSwish                hswish_162               1 1 39 40 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_160               1 1 28 41 0=1.666667e-01 1=5.000000e-01
Concat                   cat_1                    2 1 41 40 42 0=0
ConvolutionDepthWise     convdw_275               1 1 42 43 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
HardSwish                hswish_163               1 1 43 44 0=1.666667e-01 1=5.000000e-01
Convolution              conv_40                  1 1 44 45 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_164               1 1 45 46 0=1.666667e-01 1=5.000000e-01
Slice                    split_0                  1 2 46 47 48 -23300=2,24,24 1=0
Convolution              conv_41                  1 1 48 49 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSwish                hswish_165               1 1 49 50 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_276               1 1 50 51 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
Split                    splitncnn_4              1 2 51 52 53
Pooling                  gap_6                    1 1 53 54 0=1 4=1
Convolution              convrelu_2               1 1 54 55 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=1
Convolution              conv_43                  1 1 55 56 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
HardSigmoid              hsigmoid_142             1 1 56 57 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_2                    2 1 52 57 58 0=2
Convolution              conv_44                  1 1 58 59 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSwish                hswish_166               1 1 59 60 0=1.666667e-01 1=5.000000e-01
Concat                   cat_2                    2 1 47 60 61 0=0
ShuffleChannel           channelshuffle_18        1 1 61 62 0=2 1=0
Slice                    split_1                  1 2 62 63 64 -23300=2,24,24 1=0
Convolution              conv_45                  1 1 64 65 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSwish                hswish_167               1 1 65 66 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_277               1 1 66 67 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
Split                    splitncnn_5              1 2 67 68 69
Pooling                  gap_7                    1 1 69 70 0=1 4=1
Convolution              convrelu_3               1 1 70 71 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=1
Convolution              conv_47                  1 1 71 72 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
HardSigmoid              hsigmoid_143             1 1 72 73 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_3                    2 1 68 73 74 0=2
Convolution              conv_48                  1 1 74 75 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSwish                hswish_168               1 1 75 76 0=1.666667e-01 1=5.000000e-01
Concat                   cat_3                    2 1 63 76 77 0=0
ShuffleChannel           channelshuffle_19        1 1 77 78 0=2 1=0
Split                    splitncnn_6              1 3 78 79 80 81
ConvolutionDepthWise     convdw_278               1 1 81 82 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48
Convolution              conv_49                  1 1 82 83 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Convolution              conv_50                  1 1 80 84 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
HardSwish                hswish_170               1 1 84 85 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_279               1 1 85 86 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 7=24
Split                    splitncnn_7              1 2 86 87 88
Pooling                  gap_8                    1 1 88 89 0=1 4=1
Convolution              convrelu_4               1 1 89 90 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=1
Convolution              conv_52                  1 1 90 91 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
HardSigmoid              hsigmoid_144             1 1 91 92 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_4                    2 1 87 92 93 0=2
Convolution              conv_53                  1 1 93 94 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
HardSwish                hswish_171               1 1 94 95 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_169               1 1 83 96 0=1.666667e-01 1=5.000000e-01
Concat                   cat_4                    2 1 96 95 97 0=0
ConvolutionDepthWise     convdw_280               1 1 97 98 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
HardSwish                hswish_172               1 1 98 99 0=1.666667e-01 1=5.000000e-01
Convolution              conv_54                  1 1 99 100 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_173               1 1 100 101 0=1.666667e-01 1=5.000000e-01
Slice                    split_2                  1 2 101 102 103 -23300=2,48,48 1=0
Convolution              conv_55                  1 1 103 104 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_174               1 1 104 105 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_281               1 1 105 106 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_8              1 2 106 107 108
Pooling                  gap_9                    1 1 108 109 0=1 4=1
Convolution              convrelu_5               1 1 109 110 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_57                  1 1 110 111 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_145             1 1 111 112 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_5                    2 1 107 112 113 0=2
Convolution              conv_58                  1 1 113 114 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_175               1 1 114 115 0=1.666667e-01 1=5.000000e-01
Concat                   cat_5                    2 1 102 115 116 0=0
ShuffleChannel           channelshuffle_20        1 1 116 117 0=2 1=0
Slice                    split_3                  1 2 117 118 119 -23300=2,48,48 1=0
Convolution              conv_59                  1 1 119 120 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_176               1 1 120 121 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_282               1 1 121 122 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_9              1 2 122 123 124
Pooling                  gap_10                   1 1 124 125 0=1 4=1
Convolution              convrelu_6               1 1 125 126 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_61                  1 1 126 127 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_146             1 1 127 128 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_6                    2 1 123 128 129 0=2
Convolution              conv_62                  1 1 129 130 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_177               1 1 130 131 0=1.666667e-01 1=5.000000e-01
Concat                   cat_6                    2 1 118 131 132 0=0
ShuffleChannel           channelshuffle_21        1 1 132 133 0=2 1=0
Slice                    split_4                  1 2 133 134 135 -23300=2,48,48 1=0
Convolution              conv_63                  1 1 135 136 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_178               1 1 136 137 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_283               1 1 137 138 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_10             1 2 138 139 140
Pooling                  gap_11                   1 1 140 141 0=1 4=1
Convolution              convrelu_7               1 1 141 142 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_65                  1 1 142 143 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_147             1 1 143 144 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_7                    2 1 139 144 145 0=2
Convolution              conv_66                  1 1 145 146 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_179               1 1 146 147 0=1.666667e-01 1=5.000000e-01
Concat                   cat_7                    2 1 134 147 148 0=0
ShuffleChannel           channelshuffle_22        1 1 148 149 0=2 1=0
Slice                    split_5                  1 2 149 150 151 -23300=2,48,48 1=0
Convolution              conv_67                  1 1 151 152 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_180               1 1 152 153 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_284               1 1 153 154 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_11             1 2 154 155 156
Pooling                  gap_12                   1 1 156 157 0=1 4=1
Convolution              convrelu_8               1 1 157 158 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_69                  1 1 158 159 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_148             1 1 159 160 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_8                    2 1 155 160 161 0=2
Convolution              conv_70                  1 1 161 162 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_181               1 1 162 163 0=1.666667e-01 1=5.000000e-01
Concat                   cat_8                    2 1 150 163 164 0=0
ShuffleChannel           channelshuffle_23        1 1 164 165 0=2 1=0
Slice                    split_6                  1 2 165 166 167 -23300=2,48,48 1=0
Convolution              conv_71                  1 1 167 168 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_182               1 1 168 169 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_285               1 1 169 170 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_12             1 2 170 171 172
Pooling                  gap_13                   1 1 172 173 0=1 4=1
Convolution              convrelu_9               1 1 173 174 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_73                  1 1 174 175 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_149             1 1 175 176 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_9                    2 1 171 176 177 0=2
Convolution              conv_74                  1 1 177 178 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_183               1 1 178 179 0=1.666667e-01 1=5.000000e-01
Concat                   cat_9                    2 1 166 179 180 0=0
ShuffleChannel           channelshuffle_24        1 1 180 181 0=2 1=0
Slice                    split_7                  1 2 181 182 183 -23300=2,48,48 1=0
Convolution              conv_75                  1 1 183 184 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_184               1 1 184 185 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_286               1 1 185 186 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_13             1 2 186 187 188
Pooling                  gap_14                   1 1 188 189 0=1 4=1
Convolution              convrelu_10              1 1 189 190 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_77                  1 1 190 191 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_150             1 1 191 192 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_10                   2 1 187 192 193 0=2
Convolution              conv_78                  1 1 193 194 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_185               1 1 194 195 0=1.666667e-01 1=5.000000e-01
Concat                   cat_10                   2 1 182 195 196 0=0
ShuffleChannel           channelshuffle_25        1 1 196 197 0=2 1=0
Split                    splitncnn_14             1 3 197 198 199 200
ConvolutionDepthWise     convdw_287               1 1 200 201 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96
Convolution              conv_79                  1 1 201 202 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8448
Convolution              conv_80                  1 1 199 203 0=44 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4224
HardSwish                hswish_187               1 1 203 204 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_288               1 1 204 205 0=44 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=396 7=44
Split                    splitncnn_15             1 2 205 206 207
Pooling                  gap_15                   1 1 207 208 0=1 4=1
Convolution              convrelu_11              1 1 208 209 0=11 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=484 9=1
Convolution              conv_82                  1 1 209 210 0=44 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=484
HardSigmoid              hsigmoid_151             1 1 210 211 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_11                   2 1 206 211 212 0=2
Convolution              conv_83                  1 1 212 213 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3872
HardSwish                hswish_188               1 1 213 214 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_186               1 1 202 215 0=1.666667e-01 1=5.000000e-01
Concat                   cat_11                   2 1 215 214 216 0=0
ConvolutionDepthWise     convdw_289               1 1 216 217 0=176 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1584 7=176
HardSwish                hswish_189               1 1 217 218 0=1.666667e-01 1=5.000000e-01
Convolution              conv_84                  1 1 218 219 0=176 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=30976
HardSwish                hswish_190               1 1 219 220 0=1.666667e-01 1=5.000000e-01
Slice                    split_8                  1 2 220 221 222 -23300=2,88,88 1=0
Convolution              conv_85                  1 1 222 223 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7744
HardSwish                hswish_191               1 1 223 224 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_290               1 1 224 225 0=88 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=792 7=88
Split                    splitncnn_16             1 2 225 226 227
Pooling                  gap_16                   1 1 227 228 0=1 4=1
Convolution              convrelu_12              1 1 228 229 0=22 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1936 9=1
Convolution              conv_87                  1 1 229 230 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1936
HardSigmoid              hsigmoid_152             1 1 230 231 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_12                   2 1 226 231 232 0=2
Convolution              conv_88                  1 1 232 233 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7744
HardSwish                hswish_192               1 1 233 234 0=1.666667e-01 1=5.000000e-01
Concat                   cat_12                   2 1 221 234 235 0=0
ShuffleChannel           channelshuffle_26        1 1 235 236 0=2 1=0
Slice                    split_9                  1 2 236 237 238 -23300=2,88,88 1=0
Convolution              conv_89                  1 1 238 239 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7744
HardSwish                hswish_193               1 1 239 240 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_291               1 1 240 241 0=88 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=792 7=88
Split                    splitncnn_17             1 2 241 242 243
Pooling                  gap_17                   1 1 243 244 0=1 4=1
Convolution              convrelu_13              1 1 244 245 0=22 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1936 9=1
Convolution              conv_91                  1 1 245 246 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1936
HardSigmoid              hsigmoid_153             1 1 246 247 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_13                   2 1 242 247 248 0=2
Convolution              conv_92                  1 1 248 249 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7744
HardSwish                hswish_194               1 1 249 250 0=1.666667e-01 1=5.000000e-01
Concat                   cat_13                   2 1 237 250 251 0=0
ShuffleChannel           channelshuffle_27        1 1 251 252 0=2 1=0
Convolution              conv_93                  1 1 252 253 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16896
Convolution              conv_94                  1 1 198 254 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Convolution              conv_95                  1 1 79 255 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
HardSwish                hswish_195               1 1 253 256 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_18             1 3 256 257 258 259
HardSwish                hswish_196               1 1 254 260 0=1.666667e-01 1=5.000000e-01
Interp                   upsample_268             1 1 258 261 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_14                   2 1 261 260 262 0=0
Split                    splitncnn_19             1 2 262 263 264
Convolution              conv_96                  1 1 264 265 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_198               1 1 265 266 0=1.666667e-01 1=5.000000e-01
Convolution              conv_97                  1 1 266 267 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_199               1 1 267 268 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_292               1 1 268 269 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_200               1 1 269 270 0=1.666667e-01 1=5.000000e-01
Convolution              conv_98                  1 1 270 271 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Convolution              conv_99                  1 1 263 272 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_202               1 1 272 273 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_201               1 1 271 274 0=1.666667e-01 1=5.000000e-01
Concat                   cat_15                   2 1 274 273 275 0=0
Convolution              conv_100                 1 1 275 276 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_203               1 1 276 277 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_20             1 2 277 278 279
HardSwish                hswish_197               1 1 255 280 0=1.666667e-01 1=5.000000e-01
Interp                   upsample_269             1 1 279 281 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_16                   2 1 281 280 282 0=0
Split                    splitncnn_21             1 2 282 283 284
Convolution              conv_101                 1 1 284 285 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_204               1 1 285 286 0=1.666667e-01 1=5.000000e-01
Convolution              conv_102                 1 1 286 287 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_205               1 1 287 288 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_293               1 1 288 289 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_206               1 1 289 290 0=1.666667e-01 1=5.000000e-01
Convolution              conv_103                 1 1 290 291 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Convolution              conv_104                 1 1 283 292 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_208               1 1 292 293 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_207               1 1 291 294 0=1.666667e-01 1=5.000000e-01
Concat                   cat_17                   2 1 294 293 295 0=0
Convolution              conv_105                 1 1 295 296 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_209               1 1 296 297 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_22             1 2 297 298 299
ConvolutionDepthWise     convdw_294               1 1 299 300 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_210               1 1 300 301 0=1.666667e-01 1=5.000000e-01
Convolution              conv_106                 1 1 301 302 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_211               1 1 302 303 0=1.666667e-01 1=5.000000e-01
Concat                   cat_18                   2 1 303 278 304 0=0
Split                    splitncnn_23             1 2 304 305 306
Convolution              conv_107                 1 1 306 307 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_212               1 1 307 308 0=1.666667e-01 1=5.000000e-01
Convolution              conv_108                 1 1 308 309 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_213               1 1 309 310 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_295               1 1 310 311 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_214               1 1 311 312 0=1.666667e-01 1=5.000000e-01
Convolution              conv_109                 1 1 312 313 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Convolution              conv_110                 1 1 305 314 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_216               1 1 314 315 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_215               1 1 313 316 0=1.666667e-01 1=5.000000e-01
Concat                   cat_19                   2 1 316 315 317 0=0
Convolution              conv_111                 1 1 317 318 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_217               1 1 318 319 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_24             1 2 319 320 321
ConvolutionDepthWise     convdw_296               1 1 321 322 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_218               1 1 322 323 0=1.666667e-01 1=5.000000e-01
Convolution              conv_112                 1 1 323 324 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_219               1 1 324 325 0=1.666667e-01 1=5.000000e-01
Concat                   cat_20                   2 1 325 257 326 0=0
Split                    splitncnn_25             1 2 326 327 328
Convolution              conv_113                 1 1 328 329 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_220               1 1 329 330 0=1.666667e-01 1=5.000000e-01
Convolution              conv_114                 1 1 330 331 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_221               1 1 331 332 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_297               1 1 332 333 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_222               1 1 333 334 0=1.666667e-01 1=5.000000e-01
Convolution              conv_115                 1 1 334 335 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Convolution              conv_116                 1 1 327 336 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_224               1 1 336 337 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_223               1 1 335 338 0=1.666667e-01 1=5.000000e-01
Concat                   cat_21                   2 1 338 337 339 0=0
Convolution              conv_117                 1 1 339 340 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdw_298               1 1 259 341 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_226               1 1 341 342 0=1.666667e-01 1=5.000000e-01
Convolution              conv_118                 1 1 342 343 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_225               1 1 340 344 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_26             1 2 344 345 346
ConvolutionDepthWise     convdw_299               1 1 346 347 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_228               1 1 347 348 0=1.666667e-01 1=5.000000e-01
Convolution              conv_119                 1 1 348 349 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_229               1 1 349 350 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_227               1 1 343 351 0=1.666667e-01 1=5.000000e-01
BinaryOp                 add_14                   2 1 351 350 352 0=0
ConvolutionDepthWise     convdw_300               1 1 298 353 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_230               1 1 353 354 0=1.666667e-01 1=5.000000e-01
Convolution              conv_120                 1 1 354 355 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_231               1 1 355 356 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_27             1 2 356 357 358
ConvolutionDepthWise     convdw_301               1 1 358 359 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_232               1 1 359 360 0=1.666667e-01 1=5.000000e-01
Convolution              conv_121                 1 1 360 361 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdw_302               1 1 357 362 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_234               1 1 362 363 0=1.666667e-01 1=5.000000e-01
Convolution              conv_123                 1 1 363 364 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdw_303               1 1 320 365 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_236               1 1 365 366 0=1.666667e-01 1=5.000000e-01
Convolution              conv_125                 1 1 366 367 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_237               1 1 367 368 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_28             1 2 368 369 370
ConvolutionDepthWise     convdw_304               1 1 370 371 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_238               1 1 371 372 0=1.666667e-01 1=5.000000e-01
Convolution              conv_126                 1 1 372 373 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdw_305               1 1 369 374 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_240               1 1 374 375 0=1.666667e-01 1=5.000000e-01
Convolution              conv_128                 1 1 375 376 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdw_306               1 1 345 377 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_242               1 1 377 378 0=1.666667e-01 1=5.000000e-01
Convolution              conv_130                 1 1 378 379 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_243               1 1 379 380 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_29             1 2 380 381 382
ConvolutionDepthWise     convdw_307               1 1 382 383 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_244               1 1 383 384 0=1.666667e-01 1=5.000000e-01
Convolution              conv_131                 1 1 384 385 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdw_308               1 1 381 386 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_246               1 1 386 387 0=1.666667e-01 1=5.000000e-01
Convolution              conv_133                 1 1 387 388 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdw_309               1 1 352 389 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_248               1 1 389 390 0=1.666667e-01 1=5.000000e-01
Convolution              conv_135                 1 1 390 391 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_249               1 1 391 392 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_30             1 2 392 393 394
ConvolutionDepthWise     convdw_310               1 1 394 395 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_250               1 1 395 396 0=1.666667e-01 1=5.000000e-01
Convolution              conv_136                 1 1 396 397 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdw_311               1 1 393 398 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_252               1 1 398 399 0=1.666667e-01 1=5.000000e-01
Convolution              conv_138                 1 1 399 400 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_251               1 1 397 401 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_253               1 1 400 402 0=1.666667e-01 1=5.000000e-01
Convolution              conv_139                 1 1 402 403 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              convsigmoid_14           1 1 401 404 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680 9=4
Concat                   cat_22                   2 1 404 403 out3 0=0
HardSwish                hswish_245               1 1 385 406 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_247               1 1 388 407 0=1.666667e-01 1=5.000000e-01
Convolution              conv_134                 1 1 407 408 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              convsigmoid_15           1 1 406 409 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680 9=4
Concat                   cat_23                   2 1 409 408 out2 0=0
HardSwish                hswish_239               1 1 373 411 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_241               1 1 376 412 0=1.666667e-01 1=5.000000e-01
Convolution              conv_129                 1 1 412 413 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              convsigmoid_16           1 1 411 414 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680 9=4
Concat                   cat_24                   2 1 414 413 out1 0=0
HardSwish                hswish_233               1 1 361 416 0=1.666667e-01 1=5.000000e-01
HardSwish                hswish_235               1 1 364 417 0=1.666667e-01 1=5.000000e-01
Convolution              conv_124                 1 1 417 418 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              convsigmoid_17           1 1 416 419 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680 9=4
Concat                   cat_25                   2 1 419 418 out0 0=0
